Repository: 84000/data-translation-memory
Catalog: toh266-v3.tmx
Source language: bo
Languages: en

source: ཡང་ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གྱི་སྒྲོན་མའི་མཚན་ཉན་ན། མཚམས་མེད་པའི་ལས་བྱས་པ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་མ་གཏོགས་པར་དེ་དག་ཐམས་ཅད་ངན་སོང་གི་གཞི་ལས་ཐར་བར་འགྱུར་རོ། །དཀོན་མཆོག་དམ་པ་འཐོབ་པའི་རྒྱུར་ཡང་འགྱུར་རོ།
en: Śāriputra, unless they commit actions with immediate retribution and disparage the noble ones, all those who hear the name of the thus-gone one Light of the World will be free from rebirth in the lower realms.

source: །གང་དག་མཚམས་མེད་པའི་ལས་བྱེད་པ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པས་ཐོས་ན་ཡང་དེ་དག་ཀྱང་དེའི་ལས་ཟད་ནས་མཐར་གྱིས་སངས་རྒྱས་སུ་འགྱུར་རོ།
en: Even those who have committed actions with immediate retribution and disparaged the noble ones will, if they hear it, eventually become awakened once their negative karma is exhausted.

source: །བསྐལ་པ་ཉི་ཤུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།། །།བམ་པོ་གཉིས་པ།
en: In twenty eons, they will turn away from saṃsāra.

source: སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་འོད་གསལ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eight trillion buddhafields away, in the world system called Clear Light, dwells the thus-gone one, the worthy one, the completely perfect buddha called Fire

source: ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་འོད་གསལ་ཞེས་བྱ་ཞེ་ན།
en: Śāriputra, why, do you think, is the world system called Clear Light?

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཐམས་ཅད་ལག་མཐིལ་ལྟར་མཉམ་ལ་པད་མོ་ལྟར་སྣང་སྟེ།
en: The trigalactic megagalactic world system is even like the palm of a hand and appears like a lotus.

source: ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཡང་མུན་པའི་ནང་ན་མེའི་ཕུང་པོ་ལྟར་གཟི་བརྗིད་འབར་ཞིང་ལམ་མེ། ལྷན་ནེ། ལྷང་ངེ་ཞིང་ཆོས་སྟོན་པས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་མཛད་དོ།
en: Śāriputra, in that world system, the thus-gone one Fire teaches the Dharma, blazing radiantly—glittering, gleaming, and glistening—like an inferno of flames in the dark, and communicates through melody to the entire trigalactic megagalactic world system.

source: །གང་ཡང་འདི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གསེར་གྱི་སྤང་ལེབ་ཀྱིས་གཡོགས་པ། ཤིང་ཐམས་ཅད་གོས་ཀྱིས་བརྒྱན་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གྲངས་མེད་པ་ལ་ཉིན་རེ་ཞིང་སྦྱིན་པ་འབུལ་ཞིང་དེ་བཞིན་དུ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་མཉམ་པར་ཕུལ་བ་བས། གང་གིས་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་ན་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: The heap of merit generated by covering the trigalactic megagalactic world system with planks of gold, ornamenting all its trees with silk, and offering it every day to as many countless blessed buddhas as there are grains of sand in the Ganges River, for as many eons as there are grains of sand in the Ganges River, does not approach even a hundredth part of the heap of merit generated by hearing the name of that thus-gone one, nor does any analogy suffice.

source: །གང་དག་ཐོས་ནས་དགའ་བ་རྙེད་ཅིང་གང་འདོད་པ་དེ་ལ་ནན་ཏན་བྱེད་པ། བསྐལ་པ་དྲུག་ཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ། །བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་འཛིན་པར་འགྱུར་རོ།
en: Those who, having heard it, take pleasure in it and persevere in what they desire will turn away from saṃsāra in sixty eons and acquire an unexcelled buddhafield.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་བཀོད་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is the world system called Fully Arrayed.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་རྨང་ཞེས་བྱ་བ་བཞུགས་སོ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Jewel Foundation.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is a world system called Awakened

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྟག་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ། ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་རོ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Forever Passed Beyond Sorrow, where he turns the irreversible Dharma wheel.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རི་རབ་ཀྱི་ངོས་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is the world system called Slope of Mount Sumeru.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟུག་རྔུ་མེད་པའི་བློ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Mind without Torment.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཕོངས་པ་དང་བྲལ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is the world system called Free of Poverty.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤྲུལ་པ་ཚད་མེད་པར་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Appearance of Countless Emanations.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་གོས་ཀ་ཙ་ལིན་ད་ལྟར་རེག་ན་འཇམ་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is the world system called Smooth as Kācilindika Fabric.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་རབ་རྣམ་པར་གནོན་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Astride Mount Sumeru.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་མཉམ་པ་དམ་པའི་དཔལ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is the world system called Endowed with the Glory of Sublime Evenness.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་གླང་པོ་དམ་པ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Sublime Elephant of Jewels.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་འབྱུང་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is the world system called Source of Preciousness.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེ་འདུས་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Glory of Assembled Jewels.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་མ་དག་པ་དང་བྲལ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is the world system called Free of Impurity.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་རིན་པོ་ཆེ་རྟག་ཏུ་དོན་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Eternally Glorious Meaning of the Precious Irreversible Wheel.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱིས་བསྐོར་ནས་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་བསྐོར་རོ།
en: Surrounded by an assembly of bodhisattvas, he turns the irreversible wheel.

source: །ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་པ་གནས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, in the east there is the world system called Perfectly Pure Abode.

source: །དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་རྣམ་པར་སྣང་མཛད་རྣམ་པར་དག་པ་ཐོབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: There dwells the thus-gone one, the worthy one, the completely perfect buddha called Attainer of Purity of Universal Illumination.

source: ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་དེ་དག་ལ་སོགས་པ་ཚད་མེད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: “Śāriputra, an infinite number of blessed buddhas, led by these buddhas, currently dwell in the east, alive and well, teaching the Dharma.

source: །པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ། དེ་རྣམས་ཀྱི་མཚན་ནས་ཡོངས་སུ་བརྗོད་ཅིང་ཡོན་ཏན་ཚད་མེད་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ལན་གསུམ་དུ་བརྗོད་པར་བྱའོ། །ཤར་ཕྱོགས་ན་གང་དག་སྣང་བར་མཛད་པ་དེ་དག་གི་མཚན་ནས་ཡོངས་སུ་བརྗོད་པར་བྱས་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པར་འགྱུར་རོ།
en: One should kneel on one’s right knee, and, joining one’s palms with the ten fingers, proclaim the names of these buddhas and repeat three times the joyous expression, ‘Homage to those blessed buddhas endowed with infinite qualities!’ Those who proclaim the names of those illuminators in the east will acquire an immeasurable heap of merit.

source: །ལྷོ་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་ཐ་མ་ན་འཇིག་རྟེན་གྱི་ཁམས་གྲོལ་བ་ཅན་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉི་ཟླ་སྒྲོན་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “In the south, a trillion buddhafields away in the world system called Freeing, dwells the thus-gone one, the worthy one, the completely perfect buddha called Lamp of Sun and Moon.

source: ཤཱ་རིའི་བུ་ཡང་གང་དག་ཉི་ཟླ་སྒྲོན་མ་དེའི་མཚན་ཉན་ཅིང་ཐོས་ནས་ཀྱང་དགའ་བ་ཆེར་སྐྱེད་ཅིང་མོས་པར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བཀའ་ལ་རྣམ་པ་བརྒྱ་སྟོང་དུ་བསམས་ནས་བ་སྤུ་ཟིང་ཞེས་བྱེད་པ་དང་། མཆི་མ་ཡང་བླགས་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་ཅག་གིས་མཐོང་ངོ་སྙམ་དུ་རྟོགས་པར་བྱའོ།
en: Śāriputra, the sons or daughters of noble family who happen to hear the name of the thus-gone one Lamp of Sun and Moon and feel great joy and become devout upon hearing it, and who then get goose bumps and shed tears when reflecting on the hundred thousand aspects of the thus-gone one’s words, should understand that they will see that thus-gone one while they are engaging in the conduct of the bodhisattvas.

source: །བུད་མེད་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཉི་ཟླ་སྒྲོན་མ་དེའི་མཚན་བདག་གིས་ཐོས་ཀྱིས་བདག་གི་བུད་མེད་ཀྱི་ལུས་ཀྱི་མཐའ་མར་འགྱུར་རོ་སྙམ་དུ་སེམས་རབ་ཏུ་དགའ་བར་བྱ་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འགྱུར་རོ།
en: Women too should delight at the thought that by hearing the name of the thus-gone one Lamp of Sun and Moon, their female bodies will be their last and they will all also attain unexcelled, perfect and complete awakening.

source: །ཕྱོགས་བཅུའི་སེམས་ཅན་ཇི་སྙེད་ཀྱིས་ཐོས་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཏེ།
en: “All the myriad beings throughout the ten directions who hear it will make irreversible progress toward unexcelled, perfect and complete awakening.

source: སེམས་ཅན་འདི་དག་ལ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་དེ་དག་ལ་སྒྲིབ་པར་མི་འགྱུར་རོ།
en: For, just like the aforementioned beings, these beings too will not be obscured.

source: །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་གང་ཡོད་པ་དེ་དག་ཀྱང་། རྩིས་པའམ་རྩིས་པ་ཆེན་པོ་སུས་ཀྱང་རྩ་བའམ་བསྡོམ་པར་བྱ་སླ་བ་མ་ཡིན་ནོ།
en: It is not easy for even mathematicians or great mathematicians to calculate or tally how many beings exist in this Sahā world system.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཇི་སྙེད་དུ་དེའི་མཚན་གྲགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་བདུད་སྡིག་ཅན་བར་ཆད་བྱེད་པར་མི་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ཉི་ཟླ་སྒྲོན་མ་དེའི་མཚན་ཇི་སྙེད་ཀྱིས་ཐོས་ཤིང་དད་པ་ཡང་རྙེད་པ་དེ་དག་གི་མཐར་རྟོགས་པར་སླ་བ་མ་ཡིན་ནོ།
en: The evil Māra will not create obstacles in any world system where the name of that thus-gone one resounds, and it is not easy to comprehend the full scope of how many have heard the name of the thus-gone one Lamp of Sun and Moon and become filled with faith on that account.

source: །ཡང་ཤཱ་རིའི་བུ་མདོ་སྡེ་འདི་ལྟ་བུ་ཉན་པའི་སེམས་ཅན་རྣམས་ལ་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་བདུད་སྡིག་ཅན་རྣམས་ཀྱིས་བར་ཆད་བྱ་བའི་ཕྱིར་དཔུང་དང་བཞོན་པར་བཅས་པས་བརྩོན་པར་བྱེད་དེ་དེ་ནི་སྒྲིབ་པར་འགྱུར་བའི་ལས་བྱས་ཤིང་བསགས་པའི་ཕྱིར་རོ།
en: Yet, Śāriputra, the evil māras in this world system make efforts, with their troops and mounts, to create obstacles for beings that hear such sūtras as this, because those hearers have committed and accumulated actions that will lead to their obscuration.

source: །ཤཱ་རིའི་བུ་དུས་ཕྱི་མ་ལ་འདི་ལྟ་བུ་འབྱུང་སྟེ།
en: Śāriputra, such events will come to pass at a later time.

source: དེའི་ཚེ་སེམས་ཅན་གང་མཚན་བརྗོད་པའི་བསོད་ནམས་འདི་ལ་མོས་ཤིང་དད་པའི་སེམས་ཅན་དེ་དག་ནི་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་དང་འདྲ་སྟེ།
en: At that time, the beings that have devotion and faith in the merit of uttering the name will be like the uḍumbara flower.

source: འཇིག་རྟེན་གྱི་སྦྱིན་པར་འོས་པར་འགྱུར་རོ།
en: They will be worthy of worship in the world.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སླད་མའི་དུས་ན་འདི་རབ་ཏུ་དགའ་བ་ལགས་ན། དེ་ན་སེམས་ཅན་ཇི་སྙེད་ཅིག་གིས་དེ་བཞིན་གཤེགས་པ་ཉི་ཟླ་སྒྲོན་མ་དེའི་མཚན་ཐོས་པར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གཞན་གྱི་མཚན་ཀྱང་ཐོས་ནས་དད་པ་ཡང་དག་པར་བསྐྱེད་པར་འགྱུར་བ་ཇི་སྙེད་ཅིག་མཆིས།
en: The venerable Śāriputra now asked the Blessed One, “Blessed One, since this will be so very rare in the future, how many beings, at that time, will hear the name of the thus-gone one Lamp of Sun and Moon and how many will truly give rise to faith upon hearing the names of other blessed buddhas?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་གང་གིས་ཐོས་པར་འགྱུར་བ་དེ་དག་ངས་མཐོང་སྟེ།
en: The Blessed One replied to Venerable Śāriputra, “Śāriputra, I see those who will hear the names.

source: འདི་ལྟ་སྟེ་དཔེར་ན་ད་ལྟར་གྱི་སེམས་ཅན་དག་མཐོང་བ་བཞིན་ཏེ།
en: To give an example based on the beings seen at present:

source: ཤཱ་རིའི་བུ་དཔེར་ན་ད་ལྟར་གྱི་དགེ་སློང་གི་དགེ་འདུན་གོས་ངུར་སྨྲིག་བགོས་པའི་དྲུང་ན། ཁྱིམ་པ་གོས་དཀར་པོ་གྱོན་པ་གཅིག་ཡོད་པ་དེ་བཞིན་དུ་གང་འདིའི་མཚན་ཐོས་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་རྙེད་པར་དཀའོ།
en: Śāriputra, just as there is right now only one white-clad householder amidst the assembly of saffron-clad monks, beings that will hear the names of the thus-gone ones will be equally rare.

source: །ཐོས་ནས་ཀྱང་དད་པར་འགྱུར་བ་དེ་དག་ནི་ཤཱ་རིའི་བུ་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Those who will become filled with faith upon hearing it, Śāriputra, will acquire an immeasurable heap of merit.

source: །གང་དག་ཐོས་ནས་དད་པར་འགྱུར་བ་དེ་དག་ནི། ཤཱ་རིའི་བུ་ཕྱི་མའི་དུས་ན་དེ་དག་ལ་རྣམ་པར་ལྟུང་བའི་འཇིགས་པ་མི་འབྱུང་ངོ་།
en: Those who will become filled with faith upon hearing it, Śāriputra, will, in the future, have no fear of faltering.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་མི་འབྲལ་བར་འགྱུར་རོ།
en: They will never part from the blessed buddhas.

source: །འཇིག་རྟེན་ཐམས་ཅད་ལས་བྱེ་བྲག་ཏུ་འཕགས་པར་འགྱུར་རོ།
en: They will become especially exalted above the world.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་དག་ལ་བརྩམས་ནས་ཆོས་སྟོན་པར་འགྱུར་ཏེ། དེ་དག་སེམས་ཅན་མང་པོའི་དོན་བྱེད་པར་འགྱུར་རོ།
en: The blessed buddhas will teach the Dharma to them first and they will benefit many beings.

source: །ཆོས་བསྟན་པ་དེ་ལ་ཡང་གང་དག་ཉན་པ་དང་དད་པ་ཡང་དག་པ་སྐྱེད་པར་འགྱུར་བ་དེ་དག་ངའི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་བསམ་པ་ཐག་པ་ནས་འཛིན་པར་འགྱུར་ཏེ།
en: Those who hear the Dharma taught and give rise to genuine faith in it will uphold my buddha awakening from the depths of their hearts.

source: བསྐལ་པ་བརྒྱར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In a hundred eons, they will turn away from saṃsāra.

source: །ཡང་གང་དག་དད་པར་མི་བྱེད་པ་དེ་དག་ཀྱང་ངས་མཐོང་སྟེ། དཔེར་ན་ད་ལྟར་ཁྱོད་མཐོང་བ་བཞིན་ནོ།
en: “Moreover, I also see those who do not give rise to faith, just as I presently see you.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་གང་དག་ཐོས་ནས་དེ་དག་དད་པར་མི་བགྱིད་ཅིང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་འདི་ཡང་སྤོང་བར་བགྱིད་པ་དེ་དག་ལ་བསོད་ནམས་མ་ལགས་པའི་ཕུང་པོ་ཇི་ཙམ་དུ་འགྱུར།
en: Śāriputra now asked, “Blessed One, how large will be the heap of demerit for those who, upon hearing the names of those blessed buddhas, do not give rise to faith and forsake the buddhas’ awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བར་ལོ་བྱེ་བ་དྲུག་ཅུར་གནས་ཤིང་དེ་ན་སྡུག་བསྔལ་ཆེན་པོའི་ཚོར་བ་མྱོང་བར་འགྱུར་རོ།
en: The Blessed One replied, “Śāriputra, they will dwell in the hells for six hundred million years and experience the sensation of great agony there.

source: །ཤཱ་རིའི་བུ་ཕྱོགས་གང་དུ་བསྟན་པ་རབ་ཏུ་འབར་བར་གྱུར་པ་དེ་ན། དམ་པའི་ཆོས་སྤོང་བའི་སྐྱེས་བུ་བླུན་པོ་ཤིན་ཏུ་མང་བར་འགྱུར་ཏེ།
en: Śāriputra, wherever the teachings flourish there will be a great many foolish people who will forsake the sublime Dharma.

source: དེ་བས་ན་ཤཱ་རིའི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་སྤོང་བར་མི་བྱེད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་དགའ་བ་རྒྱ་ཆེན་པོ་ཡང་དག་པར་བསྐྱེད་ཅིང་། བདག་ནི་ངན་སོང་ཐམས་ཅད་ལས་ཐར་ཏོ། །སྙམ་ནས་བ་དན་བསྒྲེང་བར་བྱའོ། །གལ་ཏེ་ལ་ལ་ཞིག་གིས་འདི་སྐད་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེས་གང་བར་བྱས་ནས།
en: For this reason, Śāriputra, the sons or daughters of noble family who do not forsake this Dharma discourse should truly give rise to exultation and raise a banner with the knowledge that they will be free from all lower realms.

source: མཚན་འདི་མཉན་པར་བྱའོ། །ཞེས་དེ་སྐད་ཟེར་ན། དེས་ཆུང་ངུ་ཞིག་སྨྲས་པ་ཡིན་ཏེ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པ་ལ་གནས་པར་འདོད་པས། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གྲངས་མེད་པ་རིན་པོ་ཆེས་ཡོངས་སུ་གང་བར་བྱས་ནས་མཉན་པར་བྱའོ།
en: Suppose someone were to say, ‘I will hear this name after having filled the trigalactic megagalactic world system with jewels.’ That expresses only a small part of it—those wishing to settle into an understanding of the wisdom of omniscience should hear the names after having completely filled with jewels as many countless world systems as there are grains of sand in the Ganges River.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཚུལ་ཁྲིམས་ཀྱི་འོད་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་རབ་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “Ten thousand buddhafields away, in the world system called Endowed with the Light of Ethical Conduct, dwells the thus-gone one, the worthy one, the completely perfect buddha called Mount Sumeru.

source: ཡང་ཤཱ་རིའི་བུ་གང་གིས་དེ་བཞིན་གཤེགས་པ་རི་རབ་དེའི་མཚན་ཐོས་པར་འགྱུར་བ་དེ་དག་ནི་ཐ་ན་རྨི་ལམ་ན་ཡང་འཕགས་པ་ལ་སྐུར་པ་འདེབས་པར་མི་འགྱུར་རོ།
en: Those who hear the name of the thus-gone one Mount Sumeru will not disparage the noble ones even in their dreams.

source: །ལྷག་པའི་བསམ་པ་ཡང་དག་པར་འགྱུར་རོ།
en: They will have pure altruistic intention.

source: །དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་ཆོས་རྣམས་ལ་ཡང་རྨི་ལམ་ལྟ་བུར་མྱུར་དུ་རབ་ཏུ་ཤེས་པར་འགྱུར་ཏེ།
en: They will make irreversible progress toward unexcelled, perfect and complete awakening, and they will swiftly understand that all phenomena are like a dream.

source: བསྐལ་པ་བརྒྱད་དུ་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In eight eons, they will turn away from saṃsāra.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ལྔ་སྟོང་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་གཟུགས་གསེར་མདོག་བཟང་པོ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་རབ་མངོན་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Five thousand buddhafields away, in the world system called Beautiful Golden Form, dwells the thus-gone one, the worthy one, the completely perfect buddha called Manifest Mount Sumeru.

source: ཡང་ཤཱ་རིའི་བུ་གང་གིས་དེ་བཞིན་གཤེགས་པ་རི་རབ་མངོན་པའི་མཚན་ཐོས་པར་འགྱུར་བ་དང་། མཚན་རྒྱུན་མི་འཆད་པར་འཛིན་པ་དེ་དག་ནི་བསྐལ་པ་བཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: Those who hear the name of the thus-gone one Manifest Mount Sumeru and uphold it continuously will turn away from saṃsāra in ten eons.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་ཉི་ཤུ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཅན་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་རབ་འདྲ་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Twenty thousand buddhafields away, in the world system called Endowed with Light, dwells the thus-gone one, the worthy one, the completely perfect buddha called Image of Mount Sumeru.

source: ཤཱ་རིའི་བུ་ཡང་གང་དག་དེ་བཞིན་གཤེགས་པ་རི་རབ་འདྲ་བ་དེའི་མཚན་ཉན་ཅིང་ཐོས་ནས་ཀྱང་ཐ་ན་སེ་གོལ་གཏོགས་པ་ཙམ་ཡང་། རི་མོ་བསྐྱེད་ནས་ཡིད་ལ་བྱེད་པ་ནི། ཤཱ་རིའི་བུ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་སྤང་ལེབ་བཏིང་ནས་སྦྱིན་པ་བྱིན་པ་བས། གང་གིས་དེ་བཞིན་གཤེགས་པ་འདི་ཡིད་ལ་བྱེད་ན། བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིས་སྔ་མའི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས།
en: Śāriputra, if someone were to hear the name of the thus-gone one Image of Mount Sumeru and, upon hearing it, bring it to mind with reverence for even as brief as a mere finger snap, and if someone else were to offer as a gift the trigalactic megagalactic world system covered with planks of gold from the Jambu River, then the latter’s heap of merit would not approach even a hundredth part of that of the former, who brought this thus-gone one to mind.

source: རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ།
en: Nor would any analogy suffice.

source: དེ་ལྟར་སངས་རྒྱས་ཀྱི་སྒྲ་ནི་མཐུ་ཆེན་པོ་ཡིན་ཏེ། གང་དེ་བཞིན་གཤེགས་པ་བཞུགས་པ་ལ་བསྟི་སྟང་བྱེད་པ་དང་། མྱ་ངན་ལས་འདས་པའི་སྐུ་གདུང་ལ་མཆོད་པ་བྱེད་པ་ལྟ་ཅི་སྨོས།
en: It is because the words for buddhas are very powerful, not to mention the veneration of thus-gone ones while they are still present and the worship of their bodily remains after they have passed beyond suffering.

source: སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་གྲངས་མེད་པ་འདས་ནས་འཇིག་རྟེན་གྱི་ཁམས་སྟོབས་ཀྱི་ཤུགས་ཐམས་ཅད་ཐོབ་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་སྤོས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Innumerable thousands of buddhafields away, in the world system called Attainment of All Powerful Forces, dwells the thus-gone one, the worthy one, the completely perfect buddha called Always Fragrant.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྤོས་དེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་འདི་ལྟར་བཏབ་སྟེ།
en: Śāriputra, while engaging in the conduct of the bodhisattvas, the thus-gone one Always Fragrant made the following aspiration:

source: གང་བདག་གིས་སངས་རྒྱས་ལ་བཀུར་སྟི་བྱས་པ་དང་། གང་ཡང་དེ་བཞིན་གཤེགས་པ་སྤྲིན་སྟུག་པོ་ལ་བདུག་སྤོས་ཀྱི་རིལ་བུ་ཡུངས་འབྲུ་ཙམ་བསྲེགས་པས་དགེ་བའི་རྩ་བ་བསྒྲུབས་པ། དགེ་བའི་རྩ་བ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན།
en: ‘May I, through any roots of virtue I have accomplished by venerating the buddha and burning as little incense as a grain of mustard for the thus-gone one Dense Cloud, emit a pleasant fragrance from every pore of my body once I perfectly awaken to unexcelled, perfect and complete awakening!

source: བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་དྲི་ཡིད་དུ་འོང་བ་འབྱུང་བར་གྱུར་ཅིག །བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྤོས་ཀྱི་སྤྲིན་གྱིས་རྒྱས་པར་གྱུར་ཏེ།
en: May this cloud of incense spread to as many world systems throughout the ten directions as there are grains of sand in the Ganges River!

source: གང་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་སེམས་ཅན་རྣམས་ཀྱིས། དྲི་བསྣམས་ཤིང་མཚན་ཀྱང་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་བ་སྤུའི་ཁུང་བུ་ནས་དྲི་ཡིད་དུ་འོང་བ་འབྱུང་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: When all the beings in those world systems attain unexcelled, perfect and complete awakening by smelling this fragrance and hearing my name, may they also emit a pleasant fragrance from the pores of their bodies!’

source: །ཤཱ་རིའི་བུ་ཡང་དག་པར་བླངས་པ་གང་གིས་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྤོས་ངེས་པར་འབྱུང་བའི་ཡང་དག་པར་བླངས་པ། དེས་ངེས་པར་འབྱུང་བར་འདོད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་ཞག་བདུན་དུ་ཟན་ཆད་དེ་ཁ་ཟས་མ་ཟོས་ཀྱང་མཚན་ཉན་པ་དེ་ལྟ་བུ་ནི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པར་འགྱུར་རོ།
en: “Śāriputra, sons or daughters of noble family who wish for deliverance through the same vow by which the thus-gone one Always Fragrant reached deliverance will extol his qualities, as revealed in hearing his name, even if they have to forgo eating for seven days.

source: དེ་ཐོས་མ་ཐག་ཏུ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: It is because they will acquire an immeasurable heap of merit immediately upon hearing his name.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྤོས་ཀྱི་ཡོན་ཏན་བརྗོད་པ་ཉན་པའི་བསོད་ནམས་ཀྱི་ཚོགས་བཅོམ་ལྡན་འདས་ཀྱིས་བརྗོད་དུ་གསོལ།
en: Venerable Śāriputra then said to the Blessed One, “Blessed One, could you please elaborate on the collection of merit that comes from hearing such praises of the qualities of the thus-gone one Always Fragrant?”

source: དེ་ལ་སླད་མའི་དུས་ཀྱི་ཚེ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་དེ་དག་ཐོས་ནས་དགའ་བ་དང་རངས་པ་རྒྱ་ཆེན་པོ་འཐོབ་པར་འགྱུར་རོ།
en: The Blessed One replied, “In the future, sons or daughters of noble family will become overjoyed and exultant upon hearing those qualities.
